СкладГП/src/InformationRegisters/ЗаданияНаВывозВПодсборки/ЗаданияНаВывозВПодсборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияНаВывозВПодсборки</name>
  <resources>
    <name>Подсборка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МассивИдПакетов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ПланДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БазаПУ</name>
    <type>
      <types>CatalogRef.БазыПУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаПогрузку</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/InformationRegisters/НазначенныеПодсборки/НазначенныеПодсборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НазначенныеПодсборки</name>
  <resources>
    <name>Место</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <attributes>
    <name>НомерСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пакет</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/InformationRegisters/ЗаданияНаВывозВПодсборки/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	Если ОбщегоНазначенияКлиентПовтИсп.ЭтоERP() Тогда
		СписокОбработкаЗапросаОбновленияERP()
	Иначе
		СписокОбработкаЗапросаОбновленияПУ()	
	КонецЕсли; 
	ЗапуститьОбновлениеПодсборок();
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновленияПУ()
	
КонецПроцедуры

&НаСервере
Процедура СписокОбработкаЗапросаОбновленияERP() 
	УстановитьПривилегированныйРежим(ИСТИНА);
	СтруктураЗапроса = УКО.НоваяСтруктураПроизвольногоЗапроса();
	СтруктураЗапроса.ПараметрыЗапроса.Вставить("ИмяСклада", Константы.Склад.Получить().Наименование);	
	СтруктураЗапроса.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	pu_ЗаявкаНаПогрузкуДетальноеОписание.Ссылка КАК Ссылка,
	|	pu_ЗаявкаНаПогрузкуДетальноеОписание.Ссылка.ПланДатаПогрузки КАК ПланДатаПогрузки,
	|	pu_ЗаявкаНаПогрузкуДетальноеОписание.Ссылка.АдресПодсборки КАК АдресПодсборки,
	|	pu_ЗаявкаНаПогрузкуДетальноеОписание.Ссылка.Контрагент.Наименование КАК Контрагент
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Документ.pu_ЗаявкаНаПогрузку.ДетальноеОписание КАК pu_ЗаявкаНаПогрузкуДетальноеОписание
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад.Наименование = &ИмяСклада) КАК ТоварыНаСкладахОстатки
	|		ПО (pu_ЗаявкаНаПогрузкуДетальноеОписание.Серия = ТоварыНаСкладахОстатки.Серия)
	|			И (pu_ЗаявкаНаПогрузкуДетальноеОписание.Ссылка.Склад = ТоварыНаСкладахОстатки.Склад)
	|ГДЕ
	|	pu_ЗаявкаНаПогрузкуДетальноеОписание.Ссылка.Проведен
	|	И НЕ pu_ЗаявкаНаПогрузкуДетальноеОписание.Ссылка.АдресПодсборки = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	pu_ЗаявкаНаПогрузкуДетальноеОписание.Ссылка,
	|	pu_ЗаявкаНаПогрузкуДетальноеОписание.Ссылка.ПланДатаПогрузки,
	|	pu_ЗаявкаНаПогрузкуДетальноеОписание.Ссылка.АдресПодсборки,
	|	pu_ЗаявкаНаПогрузкуДетальноеОписание.Ссылка.Контрагент.Наименование
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(вт.Ссылка) КАК ЗаявкаНаПогрузку,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТЧ.НомерПакета) КАК Пакет,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Рег.Ячейка) КАК Ячейка,
	|	вт.ПланДатаПогрузки КАК ПланДата,
	|	вт.Ссылка.Номер КАК НомерЗаявки,
	|	вт.Контрагент КАК Покупатель,
	|	ВЫРАЗИТЬ(вт.Ссылка.Комментарий КАК СТРОКА(50)) КАК Комментарий,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(вт.АдресПодсборки) КАК Подсборка,
	|	ЛОЖЬ КАК Выполнено
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.pu_ЗаявкаНаПогрузку.ДетальноеОписание КАК ТЧ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.pu_ДвижениеПакетовПоЯчейкамСклада.СрезПоследних КАК Рег
	|			ПО ТЧ.Серия = Рег.СерияПакета
	|		ПО вт.Ссылка = ТЧ.Ссылка
	|ГДЕ
	|	НЕ вт.АдресПодсборки = Рег.Ячейка";
	ДанныеПУ = УКО.ПолучитьДанныеПроизвольногоЗапроса(СтруктураЗапроса); 
	Если ДанныеПУ = Неопределено Тогда
		Возврат 
	КонецЕсли;
	
	НЗ = РегистрыСведений.ЗаданияНаВывозВПодсборки.СоздатьНаборЗаписей(); 
	НЗ.ОбменДанными.Загрузка = ИСТИНА;
	НЗ.Отбор.БазаПУ.Установить(ОбщегоНазначенияВызовСервераПовтИсп.БазаПУ());
	НЗ.Записать(ИСТИНА); 
	ДаннныеЗаявок = ДанныеПУ.Скопировать();
	ДаннныеЗаявок.Свернуть("ЗаявкаНаПогрузку,Подсборка,Выполнено,ПланДата,НомерЗаявки,Покупатель,Комментарий"); 
	Для Каждого стр из ДаннныеЗаявок Цикл
		Нов = НЗ.Добавить();              
		Нов.БазаПУ = ОбщегоНазначенияВызовСервераПовтИсп.БазаПУ();
		ЗаполнитьЗначенияСвойств(Нов,стр);                        
		Нов.Подсборка = Справочники.Ячейки.ПолучитьСсылку(стр.Подсборка);
		ДанныеПакетов = ДанныеПУ.Скопировать(Новый Структура("ЗаявкаНаПогрузку", Нов.ЗаявкаНаПогрузку));
		МассивПакетов = ДанныеПакетов.ВыгрузитьКолонку("Пакет");
		Нов.МассивИдПакетов = Новый ХранилищеЗначения(МассивПакетов, Новый СжатиеДанных(1));
	КонецЦикла;
	НЗ.Записать(ИСТИНА);
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбновлениеПодсборок()  
	РегистрыСведений.НазначенныеПодсборки.ОбновитьРегистрПоЗаданиямНаВывоз();
	//ФоновыеЗадания.Выполнить("РегистрыСведений.НазначенныеПодсборки.ОбновитьРегистрПоЗаданиямНаВывоз", Новый Массив, "Обновление подсборок", "Обновление подсборок")
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСписок(Команда)
	СписокОбработкаЗапросаОбновления()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокОбработкаЗапросаОбновления()
КонецПроцедуры
